###################################################################

# Created by write_sdc on Tue Apr 21 22:13:39 2026

###################################################################
set sdc_version 2.1

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current uA
set_driving_cell -lib_cell INVX1 [get_ports reset_pi]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[15]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[14]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[13]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[12]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[11]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[10]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[9]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[8]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[7]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {instr_data_pi[0]}]
set_driving_cell -lib_cell INVX1 [get_ports instr_valid_pi]
set_driving_cell -lib_cell INVX1 [get_ports load_done_pi]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[6]}]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[5]}]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[4]}]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[3]}]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[2]}]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[1]}]
set_driving_cell -lib_cell INVX1 [get_ports {dbg_addr_pi[0]}]
create_clock [get_ports clka]  -period 20  -waveform {0 10}
create_clock [get_ports clkb]  -period 20  -waveform {0 10}
set_input_delay -clock clka  1  [get_ports reset_pi]
set_input_delay -clock clka  1  [get_ports instr_valid_pi]
set_input_delay -clock clka  1  [get_ports load_done_pi]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[15]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[14]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[13]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[12]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[11]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[10]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[9]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[8]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[7]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[6]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[5]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[4]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[3]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[2]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[1]}]
set_input_delay -clock clkb  1  [get_ports {instr_data_pi[0]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[6]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[5]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[4]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[3]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[2]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[1]}]
set_input_delay -clock clkb  1  [get_ports {dbg_addr_pi[0]}]
set_output_delay -clock clka  1  [get_ports halted_po]
set_output_delay -clock clka  1  [get_ports ready_po]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[15]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[14]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[13]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[12]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[11]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[10]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[9]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[8]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[7]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[6]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[5]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[4]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[3]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[2]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[1]}]
set_output_delay -clock clka  1  [get_ports {dbg_data_po[0]}]
set_clock_groups  -logically_exclusive -name clka_1  -group [get_clocks clka]  \
-group [get_clocks clkb]
